<?php

$mainValues = [
    'banned' => '❌ | شما از ربات مسدود شده اید.',
    'customer_custome_plan_day' => "⏰|لطفا  تعداد روز اشتراک را وارد کنید\n💰|هزینه هر روز: DAY-PRICE",
    'customer_custome_plan_volume'=>"🔋|لطفا مقدار گیگابایت سرویس را وارد کنید\n💰|هزینه هر گیگ: VOLUME-PRICE",
    'customer_custome_plan_name'=>'اسم اشتراک را وارد کنید',
    'send_user_id'=>"🀄️| آیدی عددی کاربر را بفرستید. می‌توانید از خود کاربر بخواهید که آیدی عددی‌اش را از بخش اطلاعات حساب کاربری ارسال کند :",
    'enter_decrease_amount'=>"💸 | مبلغی که میخواهید کم کنید را وارد کنید:",

    'enter_increase_amount'=>"💸 | مبلغی که میخواهید به آن بدهید را به تومان وارد کنید:",
    'user_not_found'=>"🥴 | همچین یوزری در دیتابیس پیدا نشد",
    'amount_decreased_from_your_wallet'=> "✅ مبلغ AMOUNT تومان از حساب شما کم شد",
    'amount_decreased_from_user_wallet'=>"✅ مبلغ AMOUNT تومان از کیف پول کاربر مورد نظر کم شد",

    'increase_wallet_cart_to_cart'=>"🪪 کاربر عزیز ، هزینه اشتراک را به یکی از کارت های زیر واریز کنید. توجه داشته باشید که بعد از واریز اطلاعات زیر را دقیقا ارسال بفرمایید. یک تصویر از فیش واریزی و یا ساعت دقیق پرداخت و مبلغ پرداخت شده به همراه شماره پیگیری :

👤 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ بعد از تایید شدن تراکنش ، لینک اشتراک شما در همینجا برای شما ارسال خواهد شد. توجه داشته باشید که تایید شدن تراکنش ممکن است مدتی به طول انجامد. لطفا صبور باشید.",
    'order_increase_sent'=>"🥇 سفارش شما با موفقیت ثبت شد.
    بعد از یید تراکنش مبلغ به کیف پولتان اضافه خواهد شد ... 🏦",


    'please_send_only_image'=>"لطفا فقط عکس ارسال کنید",
    'reached_main_menu'=>"به منوی اصلی خوش آمدید 🖖 برای ادامه میتوانید یکی از کلید های زیر را انتخاب کنید

🏠 /start",
    'increase_wallet_request_message'=>"💳 درخواست ( افزایش موجودی )

💰مبلغ: PRICE تومان
🧑‍💻 نام و نام خانوادگی : NAME
🎯 یوزرنیم : @USERNAME
🎫 کد کاربری : <code>USER-ID</code>
",

    'out_of_connection_capacity'=>'ظرفیت این کانکشن پر شده است لطفا با مدیریت تماس بگیرید یا کانکشن دیگری را انتخاب کنید',
    'out_of_server_capacity'=>'ظرفیت این سرور پر شده است لطفا با مدیریت تماس بگیرید یا سرور دیگری را انتخاب کنید',
    'can_create_specific_account'=> "روی این پلن فقط AMOUNT اکانت میتوان ساخت",


    'buy_account_cart_to_cart'=>"💳 کاربر عزیز ، هزینه اشتراک را به یکی از کارت های زیر واریز کنید. توجه داشته باشید که بعد از واریز اطلاعات زیر را دقیقا ارسال بفرمایید. یک تصویر از فیش واریزی و یا ساعت دقیق پرداخت و مبلغ پرداخت شده به همراه شماره پیگیری.. :
👤 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME

✅ بعد از تایید شدن تراکنش ، لینک اشتراک شما در همینجا برای شما ارسال خواهد شد. توجه داشته باشید که تایید شدن تراکنش ممکن است مدتی به طول انجامد. لطفا صبور باشید.",
    'renew_ccount_cart_to_cart'=>"💳 کاربر عزیز ، هزینه اشتراک را به یکی از کارت های زیر واریز کنید. توجه داشته باشید که بعد از واریز اطلاعات زیر را دقیقا ارسال بفرمایید. یک تصویر از فیش واریزی و یا ساعت دقیق پرداخت و مبلغ پرداخت شده به همراه شماره پیگیری.. :
👤 <code>ACCOUNT-NUMBER</code> - HOLDER-NAME",

    'order_buy_sent'=>"🛍 کاربر عزیز سفارشتان با موفقیت دریافت شد. بعد از پردازش های لازم ارسال خواهد شد ... 🥳",

    'buy_custom_account_request'=>"💓 خرید پلن دلخواه ( TYPE )
    
▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: <a href='tg://user?id=USER-ID'>NAME</a>
⚡️ نام کاربری: @USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK
🔋حجم سرویس: VOLUME گیگ
⏰ مدت سرویس: DAYS روز",
    'buy_new_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK",
    'buy_new_much_account_request'=>"❗️|💳 خرید جدید ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
تعداد اکانت: ACCOUNT-COUNT
✏️ نام سرویس: REMARK",
    'invite_buy_new_account'=>"👨‍👦‍👦 خرید ( زیر مجموعه )

🧝‍♂️آیدی کاربر: USER-ID
🛡اسم کاربر: NAME
🔖 نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✔️ نام سرویس: REMARK
💮 سفارش: FILENAME",

    'renew_order_sent'=>"✅| کاربر عزیز، درخواست تمدید شما با موفقت دریافت شد. لطفا تا تایید کامل درخواست صبور باشید.


برگشت به منو اصلی 🏠 /start",

    'renew_account_request_message'=>"♻️ تمدید سرویس ( TYPE )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
💰مبلغ پرداختی: PRICE تومان
✏️ نام سرویس: REMARK",
    'increase_account_request_message'=>"⏰ درخواست افزایش ( TYPE سرویس )

▫️آیدی کاربر: USER-ID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎈 نام سرویس: REMARK
🔋TYPE افزایش: INCREASE گیگ/روز
💰قیمت: PRICE تومان",
    'waiting_message'=>'⏳ در حال انتظار ...',


    'join_channel_message'=>"❌ کاربر گرامی، برای بهره‌مندی از کلیه خدمات ربات لطفا ابتدا در کانال اطلاعیه های سرویس عضو شوید.
    
✅ بعد از عضویت به ربات برگشته و بر روی دکمه زیر کلیک کنید تا عضویت شما تایید شود. با تشکر از همکاری شما 🙏

",
    'bot_is_updating'=> "🤖 ربات درحال آپدیت میباشد. لطفا دقایق آتی مجددا تلاش کنید",
    'select_one_to_show_detail'=> '🌟اگر اشتراکی نزد ما داشته باشید میتوانید لیست اشتراک های خود را ببینید.
برای دریافت اطلاعات هرکدام بر روی آنها کلیک کنید :',
    'you_dont_have_config'=>'✖ کاربر عزیز ، متاسفانه هیچ اشتراک فعالی درحال حاظر ندارید. برای شروع از بخش خرید اشتراک اقدام کنید',
    'no_order_found'=> "هیچ موردی یافت نشد",

    'config_details_message'=>"✔️ نام کانفیگ : NAME

لینک اتصال: CONNECT-LINK
 
لینک سابسکریبشن: SUB-LINK
⁮⁮ ⁮⁮ ⁮⁮ ⁮⁮
",


    'please_wait_message'=>"⏳ | لطفا منتظر باشید",
    'send_only_number'=> "❌ | لطفا فقط عدد ارسال کنید",
    'change_bot_settings_message'=>'👤هرکدوم از امکانات رو اگه تو ربات استفاده ای نداره ( خاموش ) کن !',
    'saved_successfuly'=>"✅|با موفقیت ذخیره شد",
    'invited_user_joined_message'=>"😍|تبریک یه نفر با لینک شما وارد ربات شد",
    'please_select_from_below_buttons'=>"🔘|لطفا فقط از کلید زیر استفاده کنید",
    'use_iranian_number_only'=>"🔘|لطفا فقط با شماره ایرانی اقدام کنید",
    'phone_confirmed'=>"✅|شماره شما با موفقیت تأیید شد",
    'send_your_phone_number'=>"درود کاربر عزیز، برای ادامه ما نیاز به تایید اکانت شما به عنوان اکانت واقعی و ایدانی داریم. لطفا با استفاده از دکمه زیر شماره خود را تایید کنید👇",



    'start_message'=>'با درود 👋 به ربات Mahmood VPN خوش آمدید. 🦋

لطفا برای خرید اشتراک از دکمه های قرار داده شده استفاده کنید.

در صورت وجود هرگونه سوال ، ابهام ، و یا مشکل لطفا ابتدا اقدام به مطالعه سوالات پر تکرار کرده و سپس در صورت حل نشدن مشکل به پشتیبانی پیام ارسال کنید.',
    'new_member_joined'=>"📢 | یه گل جدید عضو ربات شد :

نام و نام خانوادگی: FULLNAME
نام کاربری: @USERNAME
آیدی عددی: USERID

به نظرم یه پیام براش بفرست مثلا ( تبلیغی یا خوش آمد گویی ) 😍",

    "not_joine_yet"=>"شما همچنان در کانال عضو نیستید",
    'insert_discount_code'=>"🎁 | لطفا کد تخفیف خود را وارد کنید:",
    "not_valid_discount_code"=>"✖ | کد تخفیف وارد شده معتبر نمیباشد",
    'valid_discount_code'=>"✅ | کد تخفیف با موفقیت اعمال شد
مقدار تخفیف AMOUNT تومان",

    'used_discount_code'=>"☑️|🎁 کد تخفیف استفاده شد

👤آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
🎁 کد تخفیف: DISCOUNTCODE
💰مقدار تخفیف: AMOUNT تومان
⁮⁮ ⁮⁮",

    "send_config_uuid"=>"❗️| لطفا لینک اتصال را بدون هیچ کلمه و یا حروف اضافه ارسال کنید.
لینک های اتصال غالبا با vmess و یا vless شروع می‌شوند.

همچنین می‌توانید UUID اشتراک را نیز ارسال کنید.",
    'not_correct_text'=>"متن وارد شده معتبر نمی باشد",
    'receving_information'=>"📥 درحال دریافت اطلاعات ... ",

    'request_agency_message'=>"درخواست نمایندگی

👤آیدی کاربر: USERID
👨‍💼اسم کاربر: NAME
⚡️ نام کاربری: USERNAME
⁮⁮ ⁮⁮",

    'agency_request_sent'=>"✔ درخواست شما با موفقیت دریافت شد. لطفا تا تایید صبوری بفرمایید",
    'agency_request_already_sent'=>"❌ درخواست شما قبلا ثبت شده است. لطفا تا تایید منتظر باشید⁮⁮",
    'agency_request_declined'=>"✖ متاسفانه درخواست شما مبنی بر  خرید عمده و همکاری رد شده است.",
    'agency_request_approved'=>"✅ کاربر گرامی ضمن تبریک به اطلاع میرساند درخواست شما برای خرید عمده و همکاری پذیرفته شده است",
    'send_agent_discount_percent' =>"لطفا مقدار تخفیف این نمایندگی را وارد کنید",

    'agent_setting_message' =>"🏜 همکار عزیز ، در این بخش به راحتی امکان خرید عمده و تکی و همچنین مدیریت تمامی اشتراک های خریداری شده را دارید.",
    'selling_is_off'=>"درحال حاظر فروش بسته شده است",
    'no_server_available'=>"✖ | هیچ سرور فعالی برای سفارش موجود نیست",

    'buy_sub_select_location' => '1️⃣ مرحله یک:

💎 لوکیشن مد نظر خود را برای خرید انتخاب کنید.

💡 توجه داشته باشید تقریبا تمامی لوکیشن های مشابه (مثلا تمامی لوکیشن های انگلیس) تقریبا کیفیتی مشابه به هم دارند.

🌟 برای تست کیفیت هر لوکیشن یک حجم محدود 1 گیگابایتی یک روزه  نیز صرفا جهت تست کیفیت بر روی اینترنت شما با هزینه ناچیز(جهت جلوگیری از درخواست های بی رویه) گنجانده شده است که با خیال راحت تری اقدام به تهیه اشتراک نمایید.',
    'the_bot_in_not_admin' => "😡|ای بابا ،ربات هنوز تو کانال عضو نشده، اول ربات رو تو کانال ادمین کن و آیدیش رو بفرست",
    'category_not_avilable'=>"این سرور هیچ کتگوری تنظیم شده ای ندارد.",
    'receive_categories'=>"🗂 | درحال دریافت لیست ...",
    'buy_sub_select_category'=> "2️⃣ مرحله دو:

💡 حالا میتوانید مدت زمان اشتراک خود را انتخاب کنید.",
    'no_plan_available'=>"💡پلنی در این دسته بندی وجود ندارد",
    'receive_plans'=>" 📂 در حال دریافت لیست پلن ها",
    'buy_sub_select_plan'=> "3️⃣ مرحله سه:

🔋 در این مرحله لطفا حجم مد نظر خود را انتخاب کنید.",
    'buy_custom_plan'=>'➕ پلن مدنظر خود را خریداری کنید',
    'select_one_plan_to_edit'=>"یکی از پلن هارو برای ویرایش انتخاب کنید",

    'enter_account_amount' => "🔢 لطفا تعداد اشتراک های مد نظر خود را از عدد 1 تا5 وارد کنید.

📌 نکته مهم : انتخاب تعداد بالاتر از 5 در هر درخواست باعث بن شدن اکانت همکاری شما خواهد شد. اگر تعداد بالاتری را نیاز دارید مجددا در هر مرتبه درخواست ارسال تعداد باقی مانده را با عدد 5 و کمتر بدهید",
    'send_positive_number'=>"لطفا عددی بین 1 تا 5 وارد کنید",


    'buy_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_much_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        تعداد اکانت: ACCOUNT-COUNT
        قیمت پنل: PRICE
        ➖➖➖➖➖➖➖
        💎 قیمت کل : TOTAL-PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    'buy_custom_subscription_detail'=>"〽️ نام پلن: PLAN-NAME
        حجم اختصاصی: VOLUME GB
        مدت اختصاصی: DAYS روز
        ➖➖➖➖➖➖➖
        💎 قیمت پنل : PRICE
        ➖➖➖➖➖➖➖
        📃 توضیحات :
        DESCRIPTION
        ➖➖➖➖➖➖➖",
    "agents_list" => "🔍 لیست نمایندگان:

جهت مشاده آمار فروش نمایندگان روی اسم نماینده کلیک کنید، همچنین میتوانید برای نماینده درصد تعیین کنید یا آن را از لیست نمایندگان خارج کنید",
    'agent_deleted_successfuly'=>"نمایندگی با موفقیت حذف شد",
    'agent_details'=>'🙎‍♂️اطلاعات نماینده AGENT-NAME

سمت راست درآمد و سمت چپ تعداد خرید نماینده می باشد',
    'send_config_remark'=>"لطفا ریمارک یا همان اسم اشتراک را وارد کنید",
    'forward_your_message'=>"لطفا پیام مورد نظر خود را به ربات فروارد کنید",
    "enter_ticket_title"=>"💠لطفا موضوع تیکت را ارسال کنید!",
    "enter_ticket_description"=> "💠لطفا متن و یا عکس تیکت را بصورت ساده و مختصر ارسال کنید!",
    "sent_config_to_user"=> '✅ کانفیگ و براش ارسال کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    "renewed_config_to_user"=> '✅ کانفیگ و براش تمدید کردم
ریمارک: REMARK
حجم سرویس: VOLUME گیگ
مدت زمان سرویس: DAYS روز',
    'sending_config_to_user'=>'🚀 | 😍 در حال ارسال کانفیگ به مشتری ...',
    'config_not_found'=>"مشکلی پیش اومده، دوباره از نو انجام بده",
    'incort_creconfig_name'=>"😡|اسم وارد شده معتبر نمی باشد",
    'pay_with_tron_wallet'=>"♻️ عزیزم مبلغ AMOUNT ترون رو به والت زیر ارسال کن و تکسید آیدی واریزی ترون رو برام ارسال کن :

🔰 <code>TRON-WALLET</code>",
    'incorrect_tax_id'=>"تکسید آیدی وارد شده نامعتبر است",
    'used_tax_id'=>"این تکسید آیدی قبلا استفاده شده است",
    'in_review_tax_id'=>"تراکنش شما در صف بررسی قرار گرفت",
    'user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد گردید</b>",
    'your_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>بعد از 5 تلاش رد شد</b>",
    'incorrect_user_taxid_rejected'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'your_incorrect_taxid_rejected'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل ثبت تراکنش نادرست رد شد</b>",
    'partially_paid_user_taxid'=>"تراکنش ناموفق TYPE (ترون)
    
آیدی کاربر: USERID
اسم: NAME
یوزرنیم: USERNAME

تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'you_have_partially_paid'=>"تراکنش TYPE شما با تکسید آیدی: TAXID

<b>به دلیل عدم مطابقت مبلغ تراکنش رد شد</b>",
    'agent_discount_settings'=>"مدیریت تخفیف های نماینده AGENT-NAME"
];


$buttonValues = [
    'bot_reports'=>"📉 آمار کلی ربات",
    'message_to_user'=>"📞 پیام خصوصی",
    'user_reports'=>"🔑 اطلاعات کاربر",
    'admins_list'=>"👤 لیست ادمین ها",
    'increase_wallet'=>"💵 افزایش موجودی",
    'decrease_wallet'=>"💸 کاهش موجودی",
    'create_account'=>"⌨️ ایجاد اکانت انبوه",
    'ban_user'=>"❌ مسدود کردن کاربر",
    'unban_user'=>"✅ آزاد کردن کاربر",
    'server_settings'=>'🚦مدیریت و تنظیمات سرورها',
    'categories_settings'=>'🗂 مدیریت دسته ها',
    'plan_settings'=>'🪣 مدیریت پلن ها',
    'discount_settings'=>"🎁 مدیریت تخفیف ها",
    'main_button_settings'=>"🕹 مدیریت دکمه ها ",
    'gateways_settings'=>'💳 تنظیمات درگاه و کانال',
    'bot_settings'=>'⚙️ تنظیمات ربات',
    'tickets_list'=>'📪 تیکت ها',
    'message_to_all'=>"📨 ارسال پیام همگانی",
    'forward_to_all'=>"📨 فروارد پیام همگانی",
    'back_to_main'=>'⤵️ برگرد به منوی اصلی ',
    'cart_to_cart'=>"💳 کارت به کارت",
    'now_payment_gateway'=>"💳 درگاه NowPayment",
    'zarinpal_gateway'=> "💳 درگاه زرین پال",
    'nextpay_gateway'=>"💳 درگاه نکست پی",
    'weswap_gateway'=>"💳 درگاه ارزی ریالی",
    'approve' => 'تایید ✅',
    'approved' => 'تایید شد',
    'decline' => 'عدم تایید ❌',
    'declined' => 'رد شد',

    'back_button'=> "برگشت 🔙",
    'renew_connection_link'=>"🚷 قطع دسترسی و لینک جدید",
    'update_config_connection'=>"🪩 بروزرسانی اشتراک",
    'increase_config_volume'=>"🩸 افزایش حجم سرویس",
    'increase_config_days'=>"🗓 افزایش زمان سرویس",
    'renew_config'=>'♻ تمدید سرویس',
    'change_config_location'=>'🌎 تغییر لوکیشن',
    'selected_protocol'=>"🚦 پروتکل انتخابی",
    'volume_left'=>"⏳ حجم باقیمانده:",
    'expire_date'=>"⏰  تاریخ انقضاء: ",
    'buy_date'=>"⏰  تاریخ خرید: ",
    'plan_name'=>" 🚀 نام پلن:",
    'on'=>"روشن ✅",
    'off'=>"خاموش ❌",
    'active'=>"فعال 🟢",
    'deactive'=>"غیر فعال 🔴",
    'send_phone_number'=>'☎️ تایید شماره',
    'send_message_to_user'=>"✉️ ارسال پیام به کاربر ",
    'cancel' => '▶ بازگشت به منو اصلی',
    'join_channel'=>"عضویت در کانال",
    'have_joined'=>"در کانال عضو شدم ✅",
    'gift_volume_day'=>"🎯 هدیه حجم و زمان",
    'test_account'=>"🎁 دریافت اشتراک تست کیفیت ",
    'invite_friends'=>"🏆 دریافت موجودی رایگان",
    'my_info'=>"👤 حساب کاربری",
    'my_subscriptions'=>'🛍 اشتراک های من',
    'buy_subscriptions'=>'🛒  خرید اشتراک جدید',
    'shared_existence'=>"❕ موجودی اشتراکی ",
    'individual_existence'=>"❗️ موجودی اختصاصی ",
    'application_links'=>'🔗 راهنمایی اتصال ',
    'my_tickets'=>"📨 تماس با پشتیبانی",
    'search_config'=>"🪫 مشخصات اشتراک",
    'delete_config'=>"❌ حذف اشتراک",
    'pay_with_wallet' => "💰پرداخت با موجودی",
    'request_agency' =>"🤝 درخواست پلن همکاری",
    'agency_setting' =>"🪄 پنل همکاری",
    'agent_one_buy'=>"⭐ خرید تک اشتراک",
    'agent_much_buy'=>"🌟 خرید تعداد بالا",
    'agent_bought_accounts'=>"تعداد خرید",
    'agent_joined_date'=>"تاریخ عضویت",
    'agent_agency_date'=>"تاریخ نمایندگی",
    "agent_list"=>" 📍 مدیریت نمایندگان 📍",
    'search_agent_config'=>"جستجوی اشتراک",
    'search_admin_config'=>"جستجوی اشتراک کاربر",
    'sharj'=>"💳  شارژ کیف پول",
    'qr_config'=>"🔳 کیو آر کانفیگ",
    'qr_sub'=>"🔳 کیو آر ساب",
    'start_bot'=>"شروع ربات",
    'enable_config'=>"فعال سازی کانفیگ",
    'disable_config'=>"غیر فعال سازی کانفیگ",
    "tron_gateway"=>"درگاه ترون",
    'plan_discount'=>"روی پلن",
    'server_discount'=>"روی سرور"

];
?>
